package b;

public class Arr03Q {

	public static void main(String[] args) {
// ----------------------------------------------------------------------------------------
		
		int arr[] = new int[10];

		arr[0] = 5;
		arr[1] = 10;
		arr[2] = 15;
		arr[3] = 20;
		arr[4] = 25;
		
		arr[5] = 10;
		arr[6] = 12;
		arr[7] = 14;
		arr[8] = 16;
		arr[9] = 18;
		
// ----------------------------------------------------------------------------------------
		
		int i;
		
// ----------------------------------------------------------------------------------------
		
		for (i = 0; i < 5; i++) {
			arr[i] = (i + 1) * 5;
			System.out.println("arr[" + i + "] = " + arr[i]);
		}
		
		System.out.println();
		
		for (i = 5; i < 10; i++) {
			arr[i] = i * 2;
			System.out.println("arr[" + i + "] = " + arr[i]);
		}
		
// ----------------------------------------------------------------------------------------		
		
//		for (i = 0; i < arr.length; i++)
//		System.out.println(arr[i]);
//		
		
//		for (int i : arr)
//		System.out.println(i);  
		
		// <advanced for문>
		// 전역변수 사용 불가.
		// js의 for ~ of와 동일.
		
// ========================================================================================
		
		String str[] = {"홍길동", "바보", "그린", "아카데미", "성남시 분당구", "오류발생"};
		
		// str[n] : 배열의 n번째 문자열.		// str[n].length() : n번째 문자열의 길이.
		// arr[n] : 배열의 n번째 숫자.		// arr.length() : 해당 배열의 길이.
		
// ----------------------------------------------------------------------------------------
		
//		arr[0] += str[0].length() + 3;	// arr[0] = 5, str[0].length() = 3
//		arr[1] += str[1].length() + 3;	// arr[1] = 10, str[1].length() = 2
//		arr[2] += str[2].length() + 3;
//		arr[3] += str[3].length() + 3;
//		arr[4] += str[4].length() + 3;
//		arr[5] += str[5].length() + 3;
		
// ----------------------------------------------------------------------------------------
		
//		System.out.println("문자열 길이가 적용된 arr\n");
//		
//		for (int i = 0; i < 6; i++) { 
//			arr[i] += str[i].length() + 3;
//			System.out.println(arr[i]);
//		}
		
// ----------------------------------------------------------------------------------------
		
//		System.out.println("일반반복문으로\n");
//		
//		for (int i = 0; i < str.length; i++)
//		System.out.println(str[i]);
		
// ----------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------
		
		String result = " ";
		
// ----------------------------------------------------------------------------------------
		
//		for (String i : str) result += i;
//		
//		System.out.println("advanced for 활용 : 문자열 결합한 결과는 " + result);
		
// ----------------------------------------------------------------------------------------
		
//		result = "";
//		
//		for (int i = 0; i < str.length; i++)
//		result += str[i];
//		
//		System.out.println("일반반복문 활용한 문자열 결합 결과는 " + result);
		
// ----------------------------------------------------------------------------------------
		
//		result = "";
//		
//		for (String i : str) {
//			if (i.length() % 2 == 0)
//			result += i;
//		}
//		
//		System.out.println("advanced for문 활용하여 짝수 문자열 결합 결과 " + result);
		
// ----------------------------------------------------------------------------------------
		
//		result = "";
//		
//		for (int i = 0; i < str.length; i++) {
//			if (str[i].length() % 2 == 0)
//			result += str[i];
//		}
//		
//		System.out.println("일반 반복문 사용하여 짝수 문자열 결합 결과 " + result);
		
		
//		result = "";
//		
//		for (int i = 0; i < str.length; i++) {
//			result += str[i].length() % 2 == 0 ? str[i] : "";
//		}
//		
//		System.out.println("일반 반복문 사용하여 짝수 문자열 결합 결과 " + result);
		
	}

}
