package a;

public class Basic05 {

	public static void main(String[] args) {
		int[] arr = new int[4];
		
		arr[0] = 2;
		arr[1] = 7;
		arr[2] = 11;
		arr[3] = 13;
		
//		문1) arr 배열의 2번째 항목값이 17이 되게 하라.
		
//		arr[2] += 6;
		
// ----------------------------------------------------------------------------------------------------------------------------------------------------
		
//		문2) 반복문 이용하여 배열값의 2배를 해당 공간에 저장.
		
//		for (int i = 0; i < arr.length; i++) {
//			arr[i] *= 2;
//			System.out.println(arr[i]);
//		}
		
// ----------------------------------------------------------------------------------------------------------------------------------------------------
		
//		문3) 문자열 배열 크기가 5인 배열 선언,
//			각 배열 공간에 "1", "2", "3", "4", "5" 저장.
		
//		String[] str = new String[5];
//		
//		for (int i = 0; i < str.length; i++) {	// i = 0, 
//			str[i] = "" + (i + 1);	
////				     문자 +   숫자 : 문자	
//			System.out.println(str[i]);
//		}	
		
// ----------------------------------------------------------------------------------------------------------------------------------------------------
		
//		문4) float[] arr2 = {11.2f, 13.3f, 42.0f, 53.2f};
//			arr2의 각 성분에 3배해서 저장
//			배열 총합, 평균을 구하라.
		
		
		float[] arr2 = {11.2f, 13.3f, 42.0f, 53.2f};
		
		double sumArr2 = 0, avgArr2;
		
		for (int i = 0; i < arr2.length; i++) {
			arr2[i] *= 3; // arr2의 각 성분에 3배.
			sumArr2 += arr2[i];	
		}
		
		System.out.println(sumArr2);	// 배열 arr2 총합 출력 개행.
		
		
		avgArr2 = sumArr2 / arr2.length;	// 배열 arr2 평균.
		
//		배열명[순번] : 저장 불가.
//		str[i]
		
		
		
		
		
		
		
		
		
		
	}
}