package a;

public class Basic04 {

	public static void main(String[] args) {

		String a = "홍길동";
		// 문자열 변수 a에 홍길동 (literal 값 저장)
		
		int b = a.length();
		// 정수형 변수 b에 문자열의 길이를 제공하는 함수(메서드) length()를 사용하여
		// 문자열의 길이를 얻고 그 값을 변수에 저장
		
// ========================================================================================================================================================================		
		
		String [] str = {"감사합니다", "고맙습니다", "사랑", "증오", "미금"};
		
// ----------------------------------------------------------------------------------------------------------------------------------------------------
		
		String tt = "";
		
		tt += str[0];	// tt = "" + str[0]
		tt += str[1];	// tt = "" + str[0] + str[1]
		tt += str[2];	// tt = "" + str[0] + str[1] + str[2]
		tt += str[3];
		tt += str[4];
//		반복문으로 변경
		
//		for (int i = 0; i < str.length; i++) {
//			tt += str[i];
//		}
		
//		System.out.println(tt);
		
// ========================================================================================================================================================================		
		
//		반복문으로 변경하고, 코드 상세히 설명하라.
		
		int[] ttt = new int[5];
		
//		"ttt"라는 정수 배열 선언, 배열의 길이를 5로 초기화.
		
//		ttt[0] += str[0].length() + 3;	// ttt[0] = ttt[0] + str[0].length() + 3
//		ttt[1] += str[1].length() + 3;	// ttt[1] = ttt[1] + str[1].length() + 3
//		ttt[2] += str[2].length() + 3;
//		ttt[3] += str[3].length() + 3;
//		ttt[4] += str[4].length() + 3;
		
//		for (int j = 0; j < str.length; j++) {
//			ttt[j] += str[j].length() + 3;
//		}
		
//		정수 "j"를 선언 및 0으로 초기화, 정수 j가 배열 "str"의 길이보다 작으면, 
//		블록 실행 및 j의 값을 1씩 증가시키며, 조건식을 만족하지 않을 때까지 반복 실행.
		
//		ttt[i] += str[i].length() + 3;
		
		for (int i : ttt)
		System.out.println(ttt[i]);
		
// ========================================================================================================================================================================
		
//		for (String i : str) System.out.println(i);
		
//		advanced for문
//		for ('배열의 타입' '변수명' : '배열명')
//		해당 배열의 모든 요소를 순서대로 반복함.
		
// ========================================================================================================================================================================
		
//		str[0] += str[0] + 4;
//		str[1] += str[1] + 5;
//		str[2] += str[2] + 6;
//		str[3] += str[3] + 7;
//		str[4] += str[4] + 8;
		
//		반복문으로 변경, 코드 상세히 설명하라.
		
//		for (int i = 0; i < str.length; i++) {
//			str[i] += str[i] + (i + 4);
//			System.out.println(str[i]);
//		}
		
// ----------------------------------------------------------------------------------------------------------------------------------------------------
		
//		for (int i : str)
//		System.out.println(str[i]);
//		출력 불가.
		
// ========================================================================================================================================================================
		
//		배열
//		int[] arr = new int[i];
		
//		arr : 배열명
//		i : 배열 크기
//		int[] : 정수형 배열 선언.
		
//		arr[2];
		
		
	}	
}













